smileym4n-collab/ESP32S3I2S/sdkconfig.defaults.96k
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000

CONFIG_UAC_TUSB_MANUFACTURER="Custom"
CONFIG_UAC_TUSB_PRODUCT="ESP32-S3 USB-I2S DAC"
CONFIG_UAC_TUSB_SERIAL_NUM="ESP32S3I2S001"
CONFIG_UAC_SPEAKER_CHANNEL_NUM=2
CONFIG_UAC_MIC_CHANNEL_NUM=0
CONFIG_UAC_SAMPLE_RATE=96000
CONFIG_UAC_SPK_INTERVAL_MS=10
CONFIG_UAC_SPK_NEW_PLAY_INTERVAL=100
CONFIG_UAC_TINYUSB_TASK_PRIORITY=7
CONFIG_UAC_SPK_TASK_PRIORITY=7

CONFIG_AUDIO_SAMPLE_RATE_96000=y
CONFIG_AUDIO_BIT_DEPTH_16=y
CONFIG_AUDIO_I2S_BCLK_GPIO=-1
CONFIG_AUDIO_I2S_WS_GPIO=-1
CONFIG_AUDIO_I2S_DATA_GPIO=-1
CONFIG_AUDIO_I2S_DMA_DESC_NUM=8
CONFIG_AUDIO_I2S_DMA_FRAME_NUM=240
CONFIG_AUDIO_STREAM_BUFFER_MS=64
CONFIG_AUDIO_PREFILL_MS=20
CONFIG_AUDIO_IDLE_STOP_MS=250
